Convert Disagrams from ASCII to Mermaid
